[{
  "_id": {
    "$oid": "662b401532d71920d36ad555"
  },
  "jobId": "1009251464375",
  "title": "Field Service Technician - Wide Format",
  "location": "United States",
  "company": "Colex Finishing, Inc.",
  "link": "<a href=\"https://www.glassdoor.com/job-listing/j?jl=1009251464375\">https://www.glassdoor.com/job-listing/j?jl=1009251464375</a>",
  "jobDescription": "**Wide Format Field Service Technician** Colex Finishing – Elmwood Park, NJ 07407\n\nInternational Manufacturer of cutting and finishing equipment for the wide format printing and packaging industry has an immediate opportunity for an experienced full time field service technician. Great benefits. \\***REQUIRED to have at least 2 years experience in the Wide Format Industry and experience working with our SharpCut.\\***\n\n**Position Summary:**\n\nThe primary role of the Field Service Technician is to facilitate installation and perform service repairs of our digital router including customer training. The Field Engineer must possess exceptional customer service skills as well as have a technical ability to troubleshoot mechanical issues. Must be able to travel domestically and internationally. Travel is up to 75% of the job.\n\n**Job Requirements:**\n\n* ***2 Years Wide Format Experience***\n* ***Experience using the Colex SharpCut Flatbed Cutter***\n* Field Service in customer’s plant\n* Capable of troubleshooting printing and cutting equipment\n* Responsible to accurately document all customer service visits in a report in a timely manner\n* Ability to work independently and with others\n* Ability to utilize and understand service manuals and shop drawings.\n* Maintain a high level of integrity and professionalism\n* Good organizational skills, self-motivator and have good follow up skills\n* Have ability to work under pressure and meet deadlines\n* Maintain a positive can do attitude\n* Valid driver’s license and passport\n* Experience running a Colex SharpCut Flatbed Cutter\n\n**Preferred Experience/ Skills:**\n\n***MUST HAVE 2 Years Experience in Wide Format Print Industry***\n\n***MUST HAVE experience using the Colex SharpCut Flatbed Cutter***\n\nMust be able to manage customer situations in high speed production environment.\n\nExcellent communication skills with customers and coworkers\n\nPossess a high level of trouble shooting skills and provide a superior level of customer service.\n\nWorking knowledge of PC’s and window based operating system programs (Adobe Illustrator or Photoshop a plus)\n\nSolid systems, electrical and mechanical aptitude with ability to understand printing and cutting software, RIPS, and interfaces\n\nTraining for our specialized equipment is provided, however, the preferred candidate has experience in the printing or sign building industry, experience with digital routing or photoshop.\n\nJob Type: Full-time\n\nPay: $55,000.00 - $80,000.00 per year\n\nBenefits:\n\n* 401(k)\n* 401(k) matching\n* Dental insurance\n* Health insurance\n* Life insurance\n* Paid time off\n* Vision insurance\n\nExperience level:\n\n* 2 years\n\nSchedule:\n\n* Day shift\n* Monday to Friday\n\nExperience:\n\n* Colex SharpCut Flatbed Cutter: 1 year (Required)\n* Wide Format: 2 years (Required)\n* CNC routing: 1 year (Preferred)\n\nWillingness to travel:\n\n* 75% (Required)\n\nWork Location: Remote",
  "scapetime": {
    "$date": "2024-04-24T20:50:22.038Z"
  },
  "jobPosted": {
    "$date": "2024-04-24T00:00:00.000Z"
  }
},
{
  "_id": {
    "$oid": "662b4226dc111fa93b3c0732"
  },
  "title": "Full Charge Bookkeeper",
  "company": "New Jersey Brain and Spine",
  "location": "Hackensack, NJ",
  "description": "New Jersey Brain and Spine is seeking a highly organized and detail-oriented Bookkeeper & Payroll Processor to join our growing medical practice in Hackensack, NJ. This position may relocate to Paramus, NJ in the future.Responsibilities:Process accounts payable using QuickBooks OnlineAssist in revamping the existing QuickBooks system to ensure optimal financial reporting.Reconcile bank statements.Process payroll using Paychex.Prepare monthly profit and loss for the various locations.Serve as the primary liaison for medical, dental, vision, life, and disability insurance by working directly with the insurance broker.Act as the intermediary with the third-party administrator for the retirement plan, ensuring smooth operation and communication. Handle new employee onboarding.Maintain personnel files and benefits administration.Maintain a streamlined filing system for physical and digital documents, promoting easy access and retrieval.Qualifications:Proficiency in QuickBooks Online a MUSTExperience with Paychex, ADP, or Paylocity a plus.Bachelor's Degree Preferred.Previous experience working in a private medical practice preferred.Proficient in Microsoft Excel, Word, and Outlook.Excellent communication and interpersonal skillsStrong analytical and problem-solving abilitiesAbility to prioritize tasks and meet deadlines.Meticulous attention to detail and accuracy\nCompensation and BenefitsVery competitive salary, commensurate with education and experience. Benefit package includes health insurance, dental, vision, life, and disability insurance, 401(k) plan, and paid time off.\nSchedule:Work-life balance. Monday to Friday 8 AM to 4:30 PM or 8:30 AM to 5 PM\nLocation:Hackensack, NJ – Office is near route 4.\nCompany DescriptionNew Jersey Brain and Spine is a neurosurgical group in northern New Jersey specializing in the operative and non-operative management of a variety of neurological conditions. The center offers specialty services in spinal surgery and medicine, neurovascular disease, movement disorders, pain and palliative neurosurgery, neuro-oncology and skull-base surgery, gamma knife radiosurgery, Chiari malformation and hydrocephalus, and pediatric neurosurgery.Please submit your resume and cover letter to careers@njbrainspine.com\nAdditional InformationWe are an equal opportunity employer and value diversity at our company. We do not discriminate based on race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.\n\n\n\n",
  "apply_url": "https://www.linkedin.com/job-apply/3911514027",
  "listed_at": {
    "$numberLong": "1714092281000"
  },
  "job_id": {
    "$numberLong": "3911514027"
  },
  "job_posted": {
    "$date": "2024-04-26T01:56:52.000Z"
  }
},
{
  "_id": {
    "$oid": "662b4226dc111fa93b3c0733"
  },
  "title": "Commercial Estimator",
  "company": "Sterling Builders Group, LLC.",
  "location": "Gainesville, FL",
  "description": "Sterling Builders Group is a growing commercial construction management company located in Gainesville, FL, specializing in institutional and healthcare construction. We are looking for an experienced construction estimator to provide budget and detailed cost estimates and bids for projects in the North Central Florida region. The ideal candidate will be very comfortable with numbers and have an analytical mindset. You must have great attention to detail and excellent written and verbal communication skills. The goal for this position is to successfully win projects through accurate and thorough estimating and bid preparation, and to build an accurate cost database for budgeting during the preconstruction phase.\nAs the owner of the company, I care about the personal and professional well-being of each employee. We push for success, yet we have a strong family atmosphere where everyone is on the same team. We support each other and everyone is always willing to help out.\nConstruction Estimators are responsible for:Cost Estimation and quantity takeoff for individual projectsPreparation of proposals and deliverables for individual projectsPreparation of proposals for continuing services contractsOrganization of bidding documents, specifications, and related documents.Management of subcontractor bid lists\nDuties and responsibilities:Become familiar with our market niches.Monitor commercial plan room projects out for tender and identify projects within our scopes of workPerform quantity takeoffs and prepare bid documents for submissionManage awarded contractsMonitor and report on market and competitor activities and report to management to determine strategic plansExplore documentation in order to gain a deep understanding of the project requirementsSelect, measure and track important metricsAttend site visits and other venues necessary to do the estimatePerform analysis of collected data and metricsPrepare relevant and reliable forecastsCreate and present reports to managementBuild and maintain long-term relationships with the key vendorsJob requirements, skills and qualificationsThe position is located in Gainesville, FLPrevious working experience as construction estimator for min of 3 yearsIn-depth knowledge of project management and estimating softwareHands on experience with data research activitiesGood understanding of data analysis methodsFamiliarity with computer programs such as Autodesk Build, BuildingConnected, Bluebeam, Microsoft ProjectsGood time-management skillsAbility to manage multiple bid deadlinesStrong interpersonal and communication skillsCritical-thinker and problem-solverExperience with quantity take offs.Extensive experience reading and interpreting complex commercial construction documents and specificationsExperience with solicitation and preparation of bidsExperience in a general contracting or construction subcontractor environmentA disciplined work style with the ability to work with minimal supervisionStrong organizational skills and be a flexible self starter who is results driven.Excellent computer skills, familiarity with online plan takeoffs, MS Office Suite\n",
  "apply_url": "https://www.linkedin.com/job-apply/3911360945",
  "listed_at": {
    "$numberLong": "1714082701000"
  },
  "job_id": {
    "$numberLong": "3911360945"
  },
  "job_posted": {
    "$date": "2024-04-26T01:56:52.000Z"
  }
},
{
  "_id": {
    "$oid": "662b4227dc111fa93b3c0734"
  },
  "title": "Behavior Technician - Work with Kids - Training Provided",
  "company": "Centria Autism",
  "location": "Gaston, OR",
  "description": "We are looking for enthusiastic individuals to join our team as Behavior Technicians. As a Behavior Technician, you will have the opportunity to make a real difference in the lives of children with autism.\n\nIn this role, you will work one-on-one with children, implementing individualized behavior intervention plans under the guidance of a Board Certified Behavior Analyst (BCBA). You will use evidence-based techniques to teach communication, social, and daily living skills while reducing interfering behaviors.\n\nWe are looking for candidates who are passionate about helping children with autism reach their full potential. You will need to be patient, compassionate, and able to work well in a team environment. We will provide comprehensive training so that you are equipped and empowered to help each child, even if you don’t currently have experience. Children can be unpredictable and potentially confrontational, so this role is not for the weak of spirit, mind, or body. Part of the joy of working with kids is exercise! Our clients move, so you need to be comfortable standing, walking, sitting, grasping, reaching, bending, kneeling, crouching, squatting, lifting, and at times carrying children or objects that weigh up to 50 pounds\n\nAt the end of each day, you will go home knowing that you have made a meaningful impact on the life of a child and their family. Join us and become a part of a dedicated team that is changing lives for the better. Apply now to start your journey as a Behavior Technician with us!\n\nPay Range: $19 - $20\n\nRequirements\n\nPassionate about helping children with autism.Patient, compassionate, and able to work well in a team.18+ years of age High school diploma or GED Ability to obtain a CPR, First Aid Certification and Tuberculosis test (if you haven’t had one in the last year) Ability to pass a pre employment background check Ability to move in various positions (sit, squad, bend, etc.)Ability to lift and carry up to 50 pounds.\n\nPerks Of Working At Centria\n\nStructured career path in the field of Behavioral AnalysisDiscounts to hundreds of retail partners via our Benefit HubAccess to Centria’s Employee Assistance Plan with benefits around mental health and counselingUnlimited opportunities to make an impact in the life of a special needs child\n\nWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, Veteran status, or disability status. This job description is not intended to be an exhaustive list of qualifications, skills, efforts, duties, responsibilities, or working conditions associated with the position. This pay scale range is the full range of potential wages Centria Autism reasonably expects to pay for employees with this job title and this pay scale range varies dependent on job qualifications, performance, experience, and/or seniority. This range should not be interrupted to mean that Centria Autism currently employs any employees with this job title at the bottom or top of the pay scale range. Centria reserves the right to amend this job description at any time, with or without written notice.",
  "apply_url": "https://www.linkedin.com/job-apply/3911561021",
  "listed_at": {
    "$numberLong": "1714107168000"
  },
  "job_id": {
    "$numberLong": "3911561021"
  },
  "job_posted": {
    "$date": "2024-04-26T01:56:52.000Z"
  }
},
{
  "_id": {
    "$oid": "662b4227dc111fa93b3c0735"
  },
  "title": "IT Business Systems Analyst",
  "company": "Novelis",
  "location": "Uhrichsville, OH",
  "description": "IT Business Systems AnalystJob LocationsUS-OH-UhrichsvilleID2023-44719ScheduleFull TimeCityUhrichsvilleState/ProvinceOhioCountryUSPosition OverviewCompany OverviewNovelis is one of the world leaders in aluminum recycling and rolling and a leading sustainable aluminum solutions provider. Driven by our purpose of “shaping a sustainable world together,” we work alongside our customers to provide innovative solutions to the aerospace, automotive, beverage packaging and specialty markets. Headquartered in Atlanta, Georgia, Novelis has approximately 13,000 employees in 32 operating facilities on 4 continents. Position OverviewThe Information Technology team, located in Uhrichsville, Ohio, is seeking a IT Business Systems Analyst. Position will support 5 business locations based the mid-west United States. The Business Systems Analyst will develop effective working relationships with business partners and technical experts to provide consultation, analysis, and insights to drive development and deployment of standard methodologies, process improvements, systems and reporting solutions which deliver improved performance, cost-savings, and top results throughout the enterprise.This role must understand business processes holistically, gather requirements and analyze data across the business value stream, transform it into a manageable form, and deliver an action plan by priority to the process owners for execution.In support of smaller projects and day-to-day business engagement, the analyst coordinates the various resources, tasks, and timing, handles direct communication to end users, and assists with ongoing improvement initiatives across existing applications.Responsibilities & QualificationsResponsibilitiesShould be well versed with the Business analyst role and responsibilities, understanding BRD, FRD writing and engaging in E2E implementation on large ERP projects. Support Novelis North America IT business engagement activities. Identifies and aligns IT enablers to support business initiatives and provides input to project roadmap and project prioritization process.Collects requirements, coordinates work from technical resources, contributes to the technical design, using creative-thinking expertise and solution prototypes. Develop, configure, and present alternative solutions. Can build data-derived, but simplified models that can solve complex problems and can provide recommended solutions.Details information systems projects status, including functional and non-functional requirements, use cases, data dictionaries, crosswalks, design specifications, test plans and scripts, etc. and performs quality control and facilitates user acceptance testing. Builds and delivers correspondence, presentations, and other materials for end user training.Proactive self-starter that is highly effective both when working independently, and on a team of intelligent and driven professionals.Adhere to governance of protocol for IT engagements, prioritization of work, maintenance of portfolio and resource alignment. Adhere to established Agile and hybrid methodologies.Minimum QualificationsBS or BA in Business Administration, Supply Chain Management, Industrial Engineering, Operations, or related fields. An MBA or equivalent business graduate degree is preferred. Must have minimum 7-10 years of ERP functional and configuration experience and IT related project methodologies and life cycles.Must have detailed knowledge and understanding of business principles, concepts and terminology in Finance, Logistics, Industrial Operations, and Supply Chain processes.Manufacturing industry experience, “process manufacturing” along with Material Resource Planning (MRP) experience (production planning, scheduling, and inventory control system), preferred.Process driven analytical and critical thinking skills. Use of data analytics, and the ability to problem-solve and implement innovative, data-driven solutions. Proficiency in performing data retrieval, input, and/or general use of SAP, ERP systems, Power BI, Power Apps or Other Business Warehouse software. Able to actively learn new data management systems quickly and perform with limited guidance.Experienced in business process re-engineering or using Lean and Six Sigma concepts to improve business and operations (e.g., Kaizen, Value Stream Mapping, DMAIC, etc.) in a work environment.Strong verbal and written communication/documentation skills. Proficient in understanding BRD, FRD writing and leading E2E implementation on large ERP projects. Preferred Qualifications: ASCM(APICS) certification.What We Offer:Novelis' benefits say a lot about how we care for each other. Our employees and their families have many different needs. As a result, our benefits offer choices on many levels and are high in quality, driven by the marketplace, and affordable. In addition to core benefits, we provide these unique to the industry benefits: Family Growth Programs: Paid parental Leave, Adoption Assistance, Fertility Treatment, Childcare Discount and Nursing Mom Support Employee Assistance Programs: free resources available 24/7 to you and your family in the areas of mental health, family life, and career and financial guidance Wellness Programs: incentives for wellness activities, wellness spending account, programs for building healthy habits, virtual physical therapy for joint, back, and pelvic health, health management programs and more. Diabetes Management ProgramPet insurance Identity Theft Protection PerkSpot Discount Program Tuition assistance and career development programs  Location ProfileOpened in 1985 the Uhrichsville facility produces flat rolled aluminum sheet. The rolling mill cold rolls aluminum sheet to a desired gauge anneals to temper levels and slits the rolled sheet to size. Employing more than 350 people the facility produces aluminum sheet for building and construction automotive distribution transportation and consumer durable applications. Novelis recognizes its talented and diverse workforce as a key competitive advantage. Novelis provides equal employment opportunities to all employees and applicants. All terms and conditions of employment at Novelis, including recruiting, hiring, placement, promotion, termination, layoffs, recalls, transfers, leaves of absence, compensation, and training, are without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state, or local laws.DisclaimerWe encourage all potential candidates to follow the protocols below and to be diligent when sharing any personal information: Check the job posting is live and valid via our careers page: https://www.novelis.com/careers/Verify any communication with us by contacting our talent team at interviews@novelis.com.OptionsApply for this job onlineApplyShareEmail this job to a friendReferSorry the Share function is not working properly at this moment. Please refresh the page and try again later.Share on your newsfeedNeed help finding the right job?We can recommend jobs specifically for you!Click here to get started.Application FAQsSoftware Powered by iCIMS\nwww.icims.com",
  "apply_url": "https://www.click2apply.net/662ada9716516d9baaa3cbb2",
  "listed_at": {
    "$numberLong": "1714084554000"
  },
  "job_id": {
    "$numberLong": "3911396457"
  },
  "job_posted": {
    "$date": "2024-04-26T01:56:52.000Z"
  }
},
{
  "_id": {
    "$oid": "662b4227dc111fa93b3c0736"
  },
  "title": "Institutional Sales Representative",
  "company": "ThinkEquity LLC",
  "location": "New York, NY",
  "description": "Institutional Sales - Series 7 required\nLeading NYC based financial services firm is looking for trainees for its institutional equity sales department. Duties include identifying and qualifying institutional investors (mutual funds, hedge funds, pension funds, family offices) to market firms equity transactions and book deal and non deal roadshows both in the US and overseas.\nCollege degree and Series 7 license required along with strong work ethic, strong communications skills on the phone and ability to work well within a team This is an entry-level job (or perfect for someone looking to make a switch from retail side of business and less than 1-3 yrs of experience). Compensation: Base Salary: $ 30,000 plus commissions (paid monthly).\nPlease email resume for immediate consideration/in person interview.",
  "apply_url": "https://www.linkedin.com/job-apply/3911378489",
  "listed_at": {
    "$numberLong": "1714082734000"
  },
  "job_id": {
    "$numberLong": "3911378489"
  },
  "job_posted": {
    "$date": "2024-04-26T01:56:52.000Z"
  }
},
{
  "_id": {
    "$oid": "662b4227dc111fa93b3c0737"
  },
  "title": "Process Owner (Roto & UV)",
  "company": "Constantia Flexibles",
  "location": "Blythewood, SC",
  "description": "Company DescriptionConstantia Flexibles is the world’s third-largest producer of flexible packaging. Based on the guiding principle of ‘People, Passion, Packaging’, over 9,500 employees manufacture tailor-made packaging solutions at 36 sites in 16 countries. Many international companies and local market leaders from the consumer and pharma industries choose Constantia Flexibles’ more sustainable and innovative products. Sustainability is a top priority at Constantia Flexibles: the company was rated Level A- by Climate Change Leadership (CDP) and Gold by EcoVadis in 2022.\nRole DescriptionThis is a full-time on-site role located in Blythewood, SC for a Process Owner (Roto & UV). The Process Owner will be responsible for overseeing the roto and UV printing processes, ensuring production targets are met, and maintaining quality standards. They will collaborate with cross-functional teams to identify and implement process improvements, troubleshoot issues, and optimize productivity.\nQualificationsPrevious experience as a Process Owner or in a similar roleKnowledge of roto and UV printing processesPerform all job functions in accordance with the requirements of company's safety policies, quality management system and hygiene management standards, including all related procedures and work instructions. Monitor, track, and report performance throughout the shift (safety, quality, production output, waste) Improve processes and procedures in the pursuit of a reduction in: waste, setup times, and downtime Develop department through training and employee feedback Take effective corrective action for any performance shortfall Own performance for all staff and technical areas of responsibility. Be accountable and responsible. Participate in improvement projects and if necessary, manage and drive the projects in the assigned area (5S, Kaizan, Lean, etc.) Manage parts and supplies for assigned technical area of responsibility. Be knowledgeable in all technical areas of responsibility. Report any safety, employee or efficiency issues to the management team. Optimize work tasks regarding safety and efficiency.Inspect equipment; issue requisitions for repair. Seek resolution of any issues hindering performance. Motivate, organize and encourage teamwork for all staff Responsible for training of employees in their assigned area(s). Must monitor, evaluate, and provide training as necessary for employees and department to perform to standards. Develop and implement training plans, procedures, single point lessons, and SOPs in conjunction with Process Engineering. Train new and existing employees on all appropriate procedures, single point lesson, and SOPs. Meet w/ trainers and trainees as necessary to ensure the training needs of the trainee are being met and that the trainee is making progress as expected. Intervene and guide as necessary. Track training documentation and completion in order to ensure that pay increases are in effect without unnecessary delay. Perform other essential and non-essential functions as assigned. Handle HR and payroll activities as assigned. Ensure SAP and other business transactions are executed correctly\nExperienceHigh school diploma or general education degree (GED) and two to four years related experience and/or training; or equivalent combination of education and experience.\n",
  "apply_url": "https://www.linkedin.com/job-apply/3911352785",
  "listed_at": {
    "$numberLong": "1714077384000"
  },
  "job_id": {
    "$numberLong": "3911352785"
  },
  "job_posted": {
    "$date": "2024-04-26T01:56:52.000Z"
  }
},
{
  "_id": {
    "$oid": "662b4227dc111fa93b3c0738"
  },
  "title": "Financial Controller",
  "company": "Kentucky Trailer",
  "location": "Louisville, KY",
  "description": "Come join a team where People make a difference! As a part of Marmon Holdings, Inc., a highly decentralized organization, we rely heavily on people with the aptitude, attitude, and entrepreneurial spirit to drive our success, and we're committed to attracting and \nPosition SummaryUnder the direct supervision of the Group President, with additional oversight from the Group Controller, the Controller assumes a pivotal role in managing the financial operations of the Kentucky Trailer, Louisville business unit. This encompasses meticulous and timely recording of transactions, along with the preparation of financial statements compliant with Generally Accepted Accounting Principles (GAAP). The ideal candidate will demonstrate proficiency in overseeing cash management, accounts receivable, accounts payable, and taxation, ensuring adherence to all financial policies.\nEssential functionsFinancial IntegrityMaintains the integrity of the data captured in the general ledger and establishes and enforces appropriate controls, including Marmon standard operating procedures and Sarbanes Oxley requirements.Produces financial statement packages in accordance with monthly, quarterly, and annual schedules, including a performance evaluation across sales, COGS, SG&A, etc. Oversees accounts payable, accounts receivable, and payroll transactions ensuring information technology security requirements are met as directed by the Marmon IT Director.Facilitates internal and external audits, supports tax requirements, coordinates the annual physical inventory, maintains fixed assets, reviews multi-year contracts, and verifies the accuracy of all balance sheet accounts.Executive Partnership Evaluates and advises on the impact of long-range plans, introduction of new programs/strategies and regulatory action, including new product development, pricing, and potential acquisitions.Collaborates with the Group President and Group Controller to develop a comprehensive three-year strategic plan. Strong proficiency in continuous improvement methodologies, including coaching and empowering the accounting team to integrate Lean principles into departmental processes.Leads and coordinates the annual budget process, from gathering of inputs and assumptions to the Marmon deliverables. Fosters a continual improvement of the budgeting process through education of department managers on financial factors influencing their budgets.Decision SupportProvides timely and accurate financial analysis and insights of the business to assist the General Manager and other senior executives in performing their responsibilities.Supports cross-functional initiatives across Sales & Marketing, Operations, Supply Chain, and Human Resources by assisting with capital expenditure approval requests, innovation support, make vs. buy decisions, product pricing, customer profitability analyses, and cost containment decisions.Addresses ad hoc requests as necessary\nPosition qualifications To excel in this role, an individual must demonstrate proficiency in each essential duty. The following requirements reflect the necessary knowledge, skills, and abilities. Reasonable accommodation can be arranged for individuals with disabilities to fulfill these essential functions. The individual must have both strong leadership skills and financial acumen. Effective interpersonal skills, written and oral presentation skills, collaborative problem-solving skills, and project management skills are essential.\nSupervisory Responsibilities: Manage the assistant controller and staff accountants to oversee transactional processing, reconciliations, and journal entry preparation. Carries out supervisory responsibilities in accordance with the organization's policies and applicable laws. Responsible for building and organizing a high performing finance team. Responsibilities include collaborating with human resources to conduct interviews and facilitate employee training. Additionally, the role involves planning, assigning, and directing work; evaluating performance; administering rewards and disciplinary measures; as well as addressing grievances and resolving issues.\nEducation and/or Experience: Bachelor’s degree in accounting/finance with 10+ years of relevant experience is required - a master’s degree and/or CPA/CMA certification is a plus; supervisory experience and knowledge of GAAP, internal controls, cost accounting in a manufacturing environment, and inner-workings of ERP systems is also required. The candidate must be highly proficient in Excel and be comfortable using a variety of software packages and platforms to accumulate, manipulate, and analyze data.\n",
  "apply_url": "https://www.linkedin.com/job-apply/3911356231",
  "listed_at": {
    "$numberLong": "1714077338000"
  },
  "job_id": {
    "$numberLong": "3911356231"
  },
  "job_posted": {
    "$date": "2024-04-26T01:56:52.000Z"
  }
},
{
  "_id": {
    "$oid": "662b4227dc111fa93b3c0739"
  },
  "title": "Billing Specialist",
  "company": "Agape Home Healthcare",
  "location": "Spartanburg, SC",
  "description": "Overview\n\nBecome a Medical Billing Specialist with Agape Care Group\n\nWe are looking for a highly skilled medical billing specialist to join our team with a strong work ethic who it very detail oriented, able to multi-task, communicate effectively and be a dependable team player. As a medical billing specialist at Agape Care, you’ll process eligibility workflow, submit requests for authorizations, submit claims for processing, monitor claim rejections, post insurance payments, and follow-up on aging outstanding accounts. The ideal candidate would have previous billing experience using both UB04 and 1500 forms along with previous insurance verification experience.\n\nAnd just like all of our team members, our medical billing specialists have access to Agape Care’s supportive leadership team and professional development opportunities with plenty of room for advancement.\n\nWe’re Offering Even More Great Benefits When You Join Our Family!\n\nTuition ReimbursementImmediate Access to Paid Time OffEmployee Referral Program Bonus EligibilityMatching 401KAnnual Merit IncreasesYears of Service Award BonusesPet InsuranceFinancial and Legal Assistance ProgramMental Health and Counseling ProgramsDental and Orthodontic CoverageVision InsuranceHealth Care with Low Premiums$500 Matching Health Savings AccountShort-term and Long-term DisabilityVirgin Pulse Wellness ProgramFertility Assistance Program\n\nAbout Agape Care Group\n\nA leading hospice, palliative, and pediatric comfort care provider in the Southeast, Agape Care Group is dedicated to serving patients and families with love and delivering the highest quality care. Our network includes Agape Care South Carolina, Georgia Hospice Care, Hospice of the Carolina Foothills in North Carolina, and Journey Hospice in Alabama and Louisiana. At any location within our company, you’ll find a career that means something. You’ll not only have the opportunity to use your skills to make a real difference, but you’ll also be part of an inclusive, respectful work environment filled with peers who have answered the call to care for others.\n\nOur Company Mission\n\nAgape Care’s mission is to serve with love, providing comfort and support through compassionate care and meaningful experiences. For our team members, these aren’t empty words. In every interaction, no matter how big or small, we’re dedicated to providing a superior experience for patients facing life-limiting illnesses and their families.\n\nEssential Functions\n\nThe Billing Specialist provides services in accordance with billing requirements of related payer sources, agency policy, and accounting firm requirements. The Billing Specialist provides billing services and communicates observations and assessments to appropriate individuals. The Billing Specialist will follow uniform billing procedures and practices according to Medicare, Medicaid, 3rd party payers, and private pay in accordance with the HIM-11 guidelines.\n\nFacilitates invoice processing and submittal of bills either electronic or via paper.Prepares accurate claims for submittal to payer source.Submits claims either manually or electronically per payer source protocol, according to agency claim submittal calendar.Responds to payer inquiries regarding invoices.Completes required duties in a timely manner.Prepares correspondence to staff or payer sources accurately as directed in a timely manner.Works claim until payment or write-off occurs.Responsible for weekly reports on claim status.Gatekeeper for FSS or other types of inquiring information systems responses and information as applicable to area of responsibility.Assists supervisor with accounts review after claim submittal.Performs special projects as directed by the Director of Finance.Generates electronic payer reports as needed for assigned payers.Maintains financial and billing reports.Maintains confidentiality in all aspects of related responsibilities.Systematically reports to Supervisor EDI or invoice receipts.Serves as a member of the finance team dedicated to success of departmental responsibilities.Verifies client data into software system for billing purposes.Verifies that there are no outstanding errors per software requirement.Responds to client inquiries regarding invoices.Rebills and monitors rejections.Reviews and rebills past due accounts.Analyzes and recommends actions for delinquent accounts.Performs collection activities as directed and according to policy.Maintains organized, effective and efficient systems and communication to ensure correct billing and collection occur.Works with other personnel to assure problem solving with billing issues occur.Acts as liaison between company and payer sources for collection.Employs accuracy of data to ensure correct billing occurs.Maintains tracking on RTP, FSS, denial from private insurance and other claims queries or Medicare correspondence as required if applicable.Responsible for correspondence to fiscal intermediary as requested.Performs job in compliance with agency policies and procedures as well as professional standards.Provides an environment which promotes respect for patient, privacy, and property.Demonstrates knowledge of the patient’s Bill of Rights and upholds patient’s rights.Follows all infection control guidelines and standards per Agency policy.Demonstrates commitment, professional growth and competency.Attends meetings and assigned in-service programs.Attends training, education, seminars, or other means of learning as permitted by supervisor.Written and verbal communication is expressed clearly and in a cooperative manner.Participates on committees and task forces as requested.Promotes the Agency philosophy, mission statement and administrative policies to ensure quality of care.Maintains patient & staff privacy and confidentiality at all times pursuant to the HIPAA Privacy Final Rule.Provides positive, supportive communication to visitors, and other agency personnel.Promotes Agency image by adhering to the dress code.Reports to work as scheduled.Meets minimum productivity requirements based on agency standard.Abides by company policy and procedures as outlined by company policy manual.Performs other duties as assigned by the Supervisor.\n\nQualifications\n\nMinimum Qualifications/Requirements:\n\nEDUCATION: Associate Degree preferred.\n\nLICENSURE: Not Applicable\n\nEXPERIENCE: 5 year’s billing experience in an appropriate clinical care setting or home health environment preferred. Previous billing experience using both UB04 and 1500 forms along with previous insurance verification experience required. Accounting practices or experience preferred\n\nSKILLS: Strong work ethic, detail oriented, able to multi-task, dependable, team player and able to communicate effective with others. Knowledge of medical terminology. Must be able to speak, read and write English. Good communication, interpersonal, telephone and documentation skills. Excellent word processing skills. Must be discreet and maintain HIPAA and confidentiality in the workplace.\n\nTRANSPORTATION: Reliable Transportation - IN OFFICE ROLE - 187 North Church St. Suite 201 Spartanburg, SC 29306\n\nHEALTH STATUS: Meets all applicable agency policies and procedures related to health screening and required testing.",
  "apply_url": "https://click.appcast.io/track/jattyay?cs=pak&jg=51fv&bid=g5JZWjZ4WEUgdDqOhvmx6Q==",
  "listed_at": {
    "$numberLong": "1714098239000"
  },
  "job_id": {
    "$numberLong": "3911525020"
  },
  "job_posted": {
    "$date": "2024-04-26T01:56:52.000Z"
  }
},
{
  "_id": {
    "$oid": "662b4228dc111fa93b3c073a"
  },
  "title": "Solution Architect with Medicaid Experience",
  "company": "Gejits Infotech",
  "location": "United States",
  "description": "Gejits Infotech Inc needs a Senior Solution Architect with Medicaid Experience to join Florida State Client, Florida. This is a long-time contract Opportunity.Job Description:Solution Architect, who represents the Agency to provide oversight on the technical design and delivery of vendor solutions.In an outsourcing environment, works closely with service providers to ensure their in-scope technical solutions are consistent with the enterprise’s business strategy and architecture.Reports to the Enterprise Architect on all technical delivery related topics.May troubleshoot performance issues and resolve problems with service providers.Analyzes technology industry and market trends and maintains knowledge of new technologies to determine potential impacts to business unit service requests and service provider proposals.Understands the value of technology in the enterprise’s business processes, works with service providers to identify opportunities for innovation, cost reduction and improved efficiencies and reviews service provider solutions.Lead, advise, consult, and collaborate with the Agency on topics such as:Implementation of vendor solutions to conform with enterprise architecture, the enterprise architecture governance structure and ongoing refinement activities.Legacy Systems transition, cutover, and sunset planning activitiesTechnical Documentation maintenance activitiesVendor Task Order estimates and designsIntegration and Interoperability of business and technical servicesReviews the vendor’s technical deliverables to ensure that it conforms to the Agency’s technical standards, contract and industry standards.Facilitates technical review meetings with the Agency and vendors.Work with the vendors and the Release Managers on the deployment activities for vendor solutions.RequirementsMinimum of 5+ Years Technical Architecture design and implementation experience, including systems lifecycle management and infrastructure planning and operations.5+ Years Leadership experience managing large, cross-functions teams and projects, and influencing senior level management and key stakeholders. This is not a developer role.5+ Years Health & Human Services (HHS) experience at a solution architect level. Preference to candidates with experience in Medicaid. Should be fully conversant in various domains of Medicaid such as Recipient, Provider.Minimum of 5+ years of Medicaid technology experience including MMIS experience at a solution architect level.Proven ability to quickly earn the trust of peers and key stakeholders; mobilize and motivate teams; set direction and approach; resolve conflict; deliver tough messages with grace; execute with limited information and ambiguity.Experience with modeling tools such as Sparx and ErwinProven experience with telecommuting within a team environment.Ability to leverage remote collaboration tools efficiently and effectively.Excellent problem-solving and critical-thinking skills; balancing strategic alignment with technology roadmap and emerging industry trends with practical delivery.Strong written and verbal communication skills.",
  "apply_url": "https://www.linkedin.com/job-apply/3911563448",
  "listed_at": {
    "$numberLong": "1714110315000"
  },
  "job_id": {
    "$numberLong": "3911563448"
  },
  "job_posted": {
    "$date": "2024-04-26T01:56:52.000Z"
  }
},
{
  "_id": {
    "$oid": "662b4228dc111fa93b3c073b"
  },
  "title": "Revenue Cycle - Billing Manager",
  "company": "Infectious Disease Services of Georgia (IDSGA)",
  "location": "Atlanta Metropolitan Area",
  "description": "Infectious Disease Services of Georgia (IDSGA) provides state of the art medical care at four locations (Roswell, Cumming, Johns Creek and Canton, GA). Our physicians are board certified in Internal Medicine and Infectious Disease subspeciality. We provide consultation, medical treatment and when required intravenous treatment at our ACHC accredited Infusion Centers. \nWe are seeking an experienced Revenue Cycle/Billing Manager to manage all phases of patient financial services.\nPractice DetailsFour Locations; ACHC AccreditedHours of Operation 7 Days/week10 Physicians4 APP'sProviders provide Call/Inpatient service at 4 hospitals\nResponsibilitiesManage a team of (8-10) direct reports accountable for prior authorization, coding, billing, claims, and denial management for all components of office based, home & office infusion services, wound care, and hospital based infectious disease professional services for a ten physician group practice operating at four outpatient offices and four hospitals. Performs overall revenue management including: satisfying timely filing requirements and maximizing billing revenue and collections, and resolution of denied/rejected claims within 2-3 weeks of denial date.Ensure timely billing and collection processes for all phases of accountability.Ensure all unbilled claims are identified, researched, and submitted on a weekly basis.Review service codes, rates, and contract billing requirements assuring compliance to obtain clean claim submissions on first attempt 90% of the time or greater.Ensure accountable staff perform all activities in accordance with policies and procedures including compliance with payer, state, and federal requirements, regulations, and guidelines.Conduct regular review and analysis of claims to ensure contract standards are being met.Ensure integrity and consistency in payment posting and cash balancing activities.Monitor account receivables. Proactively report delinquent collections and issues to Practice Administrator and CFO on a timely basis. Establish claim-processing standards to ensure compliance with contractual and industry standards.Perform audits of current procedures and processes, identify areas to improve and streamline for continuous quality improvement and revenue cycle integrity. Reduce revenue cycle leakage, days in accounts receivables and bad-debt write-offs to best practice industry standards.Prepare claim appeals for comprehensive, complete, and timely resolution.Responsible for hiring, training, and supervising assigned staff.Provide training and mentoring to employees to ensure optimal outcomes, efficiency, consistency, best practice, and a high degree of productivity.Conduct performance evaluations of direct reports, create professional development and performance improvement plans, as needed.Manage customer service inquiries and ensure timely resolution of patient billing issues and complaints.Provide leadership and management oversight in accordance with ACHC accreditation for infusion services, including collaboration with nursing, clinical, physician, pharmacist and administrative professionals.\n\nQualificationsBachelor’s degree plus 5-7 years progressive healthcare billing and supervisory experience. 10+ years of progressive, hands-on medical claims experience can be substituted for bachelor’s degree.Medical and Billing Certification preferred.Infusion based billing experience with knowledge of specialty infusion drugs preferred.Thorough knowledge and working experience of CPT, HCPCS, and ICD10 codes, CMS-1500 claim forms, medical terminology, appeal/denial processes, insurance recoupments, billing and insurance regulations, and updates.Experience with automated billing systems and data management systems required. Demonstrate proven leadership qualities including excellent communication skills, efficiency, customer focus, empathy, active problem solving, curiosity, and critical thinking.Must be able to work onsite with occasional travel to other locations, as needed.\nCompetitive compensation and benefits package. Full-time position (40 hours/week). \nInterested candidates should forward a letter of interest and CV/Resume to cwelkis@idsga.comThis position will be based out of our Roswell location with occasional travel to other locations.\n\n",
  "apply_url": "https://www.linkedin.com/job-apply/3911366024",
  "listed_at": {
    "$numberLong": "1714080965000"
  },
  "job_id": {
    "$numberLong": "3911366024"
  },
  "job_posted": {
    "$date": "2024-04-26T01:56:52.000Z"
  }
},
{
  "_id": {
    "$oid": "662b4228dc111fa93b3c073c"
  },
  "title": "Physical Therapist",
  "company": "Dynamic HC Recruiting Inc.",
  "location": "St Petersburg, FL",
  "description": "We are looking for a detail oriented and clinically skilled Physical therapist to join our dynamic team.  Joining our team means you will be part of a group dedicated to providing the best and highest quality of resident care and excellent customer service. We take pride in making a difference in the lives of our residents and their families and look forward to you coming aboard to join us.Physical Therapist ResponsibilitiesAs a registered Physical Therapist at our skilled nursing and rehabilitation facility, you will play a critical role in providing skilled Physical Therapy to our residents. You are responsible for providing the highest quality of Physical therapy, to meet the needs of our residents and achieve resident outcomes. You are conscientious and organized about keeping quality documentation and all records up to date. You always encourage an atmosphere of optimism, warmth and sincere concern for our residents and team members. Making a positive impact on the lives of our residents and families brings you a great deal of satisfaction.Physical Therapy Requirements· Valid Florida professional license as a Registered Physical Therapist · Accepting new and seasoned therapists · Must have a degree from an accredited Physical Therapy program. · Must be knowledgeable of PDPM, LTC programing and PT scope of practice. · Ability to quickly learn and navigate Net Health and Point Click Care Physical Therapy Perks and Benefits · Benefits after 60 days. · Paid weekly. · Flexible Schedules · Excellent hourly rate with annual increase eligibility · PTO (PAID TIME OFF) plan/ Healthcare Insurance · Continuing Education allowance · Professional License Reimbursement · Refer a Friend BonusPhysical Setting· Long term care · SNFHourly $38.00 to 45.00 hour (Full time/hourly depending on experience",
  "apply_url": "https://www.linkedin.com/job-apply/3911358637",
  "listed_at": {
    "$numberLong": "1714078209000"
  },
  "job_id": {
    "$numberLong": "3911358637"
  },
  "job_posted": {
    "$date": "2024-04-26T01:56:52.000Z"
  }
},
{
  "_id": {
    "$oid": "662b4228dc111fa93b3c073d"
  },
  "title": "Associate Attorney",
  "company": "National Law Firm",
  "location": "Ohio, United States",
  "description": "We are a national consumer-advocacy law firm providing representation to clients who have fallen into financial difficulty. With our young and growing firm, we offer the opportunity to broaden and develop your legal career in a practice that is rich in variety and challenges. If you desire to work with other talented people who share your passion for delivering excellent service to our clients, then a career with us may be a perfect fit for you!\nOur firm is based in New York City and we are currently seeking a full-time Associate Attorney to work remotely in Ohio. This position entails working with managing attorneys and support staff exclusively through communications via telephone, and e-mail. This position imparts broad responsibilities and exposes you to a range of legal issues related to consumer protection, including transactional and civil litigation matters.\nWhat We Offer:Compensation is competitive and commensurate with expertise and previous experienceRemote Work EnvironmentTraining & GuidanceMedical, Dental & Vision Benefits401K Benefits with Employer MatchPaid Time Off (PTO)Promotion & Growth opportunitiesAn incredible team of smart and supportive people!Required Skills & Experience:Must be currently admitted to practice law in Ohio (multiple-state admission is a big PLUS)Minimum of 1 year of relevant experience at a law firmMust be able to work independently as well as in collaboration with othersPossess superior organizational & time-management skills necessary to meet strict time deadlinesHighest ethical standards and professional integrityExceptional written and oral communication skillsProficiency in LexisNexis is a plusStrong interpersonal skills and ability to partner with employees of all levels throughout the organizationPrincipal Duties & Responsibilities:Maintaining and supervising a heavy & diversified caseload of the firm’s clients in Ohio.Drafting pleadings, motions, legal memoranda, stipulations of settlement, etc.Communicating with clients regarding their respective mattersCommunicating with opposing parties to resolve/settle claimsLegal research related to simple and complex issues in contract law and other areas of consumer law",
  "apply_url": "https://www.linkedin.com/job-apply/3911504336",
  "listed_at": {
    "$numberLong": "1714088122000"
  },
  "job_id": {
    "$numberLong": "3911504336"
  },
  "job_posted": {
    "$date": "2024-04-26T01:56:52.000Z"
  }
},
{
  "_id": {
    "$oid": "662b4228dc111fa93b3c073e"
  },
  "title": "Learning Specialist",
  "company": "The Academy of the Holy Cross",
  "location": "Kensington, MD",
  "description": "PRINCIPAL RESPONSIBILITIES:General Responsibilities● Work cooperatively with the Director of Saint Mary’s Resource Program to ensure students with accommodations are maximizing their resources and implementing academic accommodations.● Collaborate with the Director of the Saint Mary’s Resource Program and Counseling staff to develop and implement programs based on the academic needs of students.● Interpret formal evaluations and assessments for purposes of supporting students and staff in understanding student needs and implementing strategies for academic success.● Monitor the academic performance of students with accommodations and intervene when concerns are noted (via teachers, decline in grades, etc.).● Analyze and interpret student data to develop strategies and appropriate interventions and supports. ● Provide direct academic support and supervision in the Saint Mary’s Resource Center on a daily basis during SMRP study hall.● Facilitate meetings between students, teachers, and parents about issues of concern.● Develop and foster effective relationships with students and be available during times when students are not in class.● Collaborate with the Director of SMRP to submit standardized testing accommodations and coordinate school-based standardized testing.● Provide parents, teachers, advisors, tutors, and students with specific information about a student’s learning, academic performance, and most effective instructional techniques.● Encourage and support students in exploration of strengths, limitations, and new activities.● Create lessons designed to support study skills and students’ academic classes● Refer students to school-based academic resources (e.g., teachers, study hall, math lab, HS tutors, etc.) and external referrals, if requested.● Empower students to understand their learning strengths and challenges and to advocate for their needs.● Provide academic skills training and executive functioning training such as organization, planning, time management, study skills, and test-taking skills.● Collaborate with faculty and staff to support students in implementing accommodations and effective academic accommodations. Administrative Duties● Maintain student files and ensure confidentiality (grades and progress notes, test results, correspondence, etc.)● Maintain records of phone contacts, written correspondence, and student office visits.● Serve on school committees as needed.● Attend all SMRP Department and faculty meetings.● Assist with Admission interviews\nJOB REQUIREMENTS: EDUCATION: Master’s degree in Special Education or related field\nEXPERIENCE:● Must have a minimum of three years of experience working in a classroom setting with children with learning differences● Must have experience working with students with learning disabilities and demonstrated the ability to interpret results of neuropsychological and psychoeducational evaluations, IQ tests, achievement tests and other diagnostic tests as well as training in developing and implementing strategies that will allow different learning styles to achieve success. ",
  "apply_url": "https://www.linkedin.com/job-apply/3911505667",
  "listed_at": {
    "$numberLong": "1714089442000"
  },
  "job_id": {
    "$numberLong": "3911505667"
  },
  "job_posted": {
    "$date": "2024-04-26T01:56:52.000Z"
  }
},
{
  "_id": {
    "$oid": "662b4228dc111fa93b3c073f"
  },
  "title": "Transition Specialist",
  "company": "Summit Financial",
  "location": "Parsippany, NJ",
  "description": "Overview:Ranked one of the top 100 top RIAs by Barron’s & Forbes and headquartered in Parsippany, New Jersey with several regional offices across the country, Summit Financial LLC is a ~$10 billion independent advisory firm that has been providing comprehensive financial planning and wealth management services to high-net-worth individuals for over 40 years. We are looking for a Financial Planner to join our growing team. The role is responsible for supporting a specific team of Advisors in the preparation and presentation of financial plans and various planning analyses to clients. This includes the implementation of financial recommendations and acting as the “point person” on all planning questions and analyses. Duties will include gathering financial information from clients and inputting it into various financial planning software.\nThe Operations Transition Specialist will be participating in a variety of roles with increasing responsibility. The role requires the ability to be an effective communicator and team builder with strong analytical, managerial and organizational skills.\nROLE AND RESPONSIBILITIES:Makes recommendations for streamlining processesAssist representatives and assistants with issues involving accounts.Reviewing the opening of new account and existing accounts.Exceptional customer service and organizational skillsAbility to problem solve various account issues that involve account maintenance and money movementAbility to maintain accurate logs of paperwork and information received for client relationshipsResearch of account inquires/issues for representatives and assistants.Data entry of client information into our proprietary systemsAbility to review custodial E-Sign paperwork as well as Summit Docu-sign paperwork to ensure accountopening approvalAssists representatives and assistants in various procedures required to fulfill individual client need.Adhere to managerial functions and duties when called upon.Serve as liaison for reps and assistants with custodians such as Fidelity Investments, Charles Schwab, and Pershing.Ability to understand and process all functions required by Reps and assistants throughout the custodian’s account opening process and maintenanceProvide training (when necessary) to various reps and assistances when required. Training involves initial custodian processing of new accounts and their existing functions.Provide initial training on all Summit paperwork requirements and mechanics linked to Custodial Account openings and various account maintenanceQUALIFICATIONS AND EDUCATION REQUIREMENTS:Requires a bachelor’s degreeRequires a minimum of 3 years’ experiencePREFERRED SKILLS:Proficiency in Microsoft Office products including OutlookExcellent communication and time management skillsGoal oriented and reliableFamiliarity with custodial systems Fidelity, Charles Schwab and Pershing a plus",
  "apply_url": "https://www.indeed.com/jobs?q=transition+specialist&l=Parsippany%2C+NJ&radius=0&vjk=7e24b37b1169e113",
  "listed_at": {
    "$numberLong": "1714080833000"
  },
  "job_id": {
    "$numberLong": "3911370502"
  },
  "job_posted": {
    "$date": "2024-04-26T01:56:52.000Z"
  }
},
{
  "_id": {
    "$oid": "662b4229dc111fa93b3c0740"
  },
  "title": "Optometrist",
  "company": "Charles B. Wang Community Health Center",
  "location": "New York City Metropolitan Area",
  "description": "Full-Time OptometristReports To: Chief of Primary Eye Care\n131-72 40th RoadFlushing, New York, 11354United States\nThe Charles B. Wang Community Health Center, an award-winning federally qualified community health center in New York City, is seeking a full-time Optometrist to join its Primary Eye Care service in Flushing, Queens, servicing underserved Asian Americans in a high quality, vibrant and compassionate environment.\nResponsibilities:Provide quality optometric eye care, including conducting eye exams, diagnosing vision problems, prescribing eyeglasses, medical co-management of cataracts, glaucoma and other diseases affecting the eye, and medical treatment for routine eye problemsWork with the Internal Medicine team to ensure that patients are receiving comprehensive medical careRepresent the Health Center in the larger community and participate in educational workshops as neededPerform other duties as assigned\nMinimum Qualifications:Possess a Doctor of Optometry degree from an accredited school of optometryLicensed to practice optometry in the State of New YorkResidency-trained candidates preferredBilingual in English/Mandarin a plusSaturday availability necessary\nCompensation and Benefits:Salary: $140,000 - $160,000 per yearMedical insuranceEmployer-paid dental, vision, disability and life insuranceEmployer-paid malpractice coverage through FTCA403(b) retirement savings planFlexible spending accounts for transit, parking, health and dependent carePaid time off (6 weeks)Continuing medical education time and allowanceEmployee Assistance ProgramNational Health Services Corps loan repayment program available, andThe Health Center is qualified for Public Service Loan Forgiveness (PSLF) program\nInterested parties may contact Annie Ma, HR Manager, at ama@cbwchc.org to learn more or apply online.\n",
  "apply_url": "https://cbwchc.csod.com/ats/careersite/JobDetails.aspx?id=1064&site=5&source=LinkedIn",
  "listed_at": {
    "$numberLong": "1714087030000"
  },
  "job_id": {
    "$numberLong": "3911399538"
  },
  "job_posted": {
    "$date": "2024-04-26T01:56:52.000Z"
  }
}]